app/Http/Controllers/admin/ArchCourseController.php

    public function index()
    {

        $ArchiveCourses['ArchiveCourses'] = ArchCourse::all();
---
select * from `arch_courses`