app/Http/Controllers/admin/ArchCourseLessonController.php

    public function index()
    {
        $ArvhiveCoursesLessions['ArvhiveCoursesLessions'] = ArchCourseLesson::join('arch_courses', 'arch_courses.id', '=', 'arch_course_lessons.archive_course_id')->select('arch_course_lessons.*', 'arch_courses.arch_name')->latest()->get();
---
select `arch_course_lessons`.*, `arch_courses`.`arch_name` from `arch_course_lessons` inner join `arch_courses` on `arch_courses`.`id` = `arch_course_lessons`.`archive_course_id` order by `created_at` desc

    public function create()
    {
        $ArchCourses['ArchCourses'] = ArchCourse::all();
---
select * from `arch_courses`

    public function destroy($id)
    {

        $ArvhiveCoursesLession = ArchCourseLesson::find($id);
        $ArvhiveCoursesLession->delete();
---
select * from `arch_course_lessons` where `arch_course_lessons`.`id` = '1' limit 1
delete from `arch_course_lessons` where `id` = 1