app/Http/Controllers/admin/ArchCourseLessonAssignmentController.php

select * from `arch_course_lessons` inner join `arch_course_lesson_assignments` on `arch_course_lessons`.`id` = `arch_course_lesson_assignments`.`archive_course_lession_id`
select `arch_course_lesson_assignments`.*, `arch_course_lessons`.`name`, `arch_courses`.`arch_name` from `arch_course_lesson_assignments` inner join `arch_course_lessons` on `arch_course_lessons`.`id` = `arch_course_lesson_assignments`.`archive_course_lession_id` inner join `arch_courses` on `arch_courses`.`id` = `arch_course_lesson_assignments`.`archive_course_id`
---
    public function index()
    {

        $ArchCourseLessonAssignments =
        DB::table('arch_course_lesson_assignments')
        ->join('arch_course_lessons', 'arch_course_lessons.id', '=', 'arch_course_lesson_assignments.archive_course_lession_id')
        ->join('arch_courses', 'arch_courses.id', '=', 'arch_course_lesson_assignments.archive_course_id')
        ->select('arch_course_lesson_assignments.*', 'arch_course_lessons.name', 'arch_courses.arch_name')
        ->get();

select * from `arch_courses`
select * from `arch_course_lessons`
---
    public function create()
    {
        $ArchCourses= ArchCourse::all();
        $ArchCourseLessons= ArchCourseLesson::all();

insert into `arch_course_lesson_assignments` (`archive_course_id`, `archive_course_lession_id`, `title`, `details`, `valid`, `created_by`, `updated_at`, `created_at`) values ('1', '2', 'A.L.A', 'A.L.AA.L.AA.L.AA.L.AA.L.A', '1', 2, '2022-11-24 13:13:29', '2022-11-24 13:13:29')
---
    public function store(Request $request)
    {
        $request->validate([
            'archive_course_id'         => 'required',
            'archive_course_lession_id' => 'required',
            'title'                     => 'required',
            'details'                   => 'required',
           ]);
           ArchCourseLessonAssignment::create([
            'archive_course_id'         => $request->archive_course_id,
            'archive_course_lession_id' => $request->archive_course_lession_id,
            'title'                     => $request->title,
            'details'                   => $request->details,
            'valid'                     => $request->valid,
            'created_by'                => Auth::guard('admin')->user()->id

        ]);

select * from `arch_courses`
select * from `arch_course_lessons`
select * from `arch_course_lesson_assignments` where `arch_course_lesson_assignments`.`id` = '6' limit 1
---
    public function edit($id)
    {
        $ArchCourses= ArchCourse::all();
        $ArchCourseLessons= ArchCourseLesson::all();
        $ArchCourseLessonAssignments = ArchCourseLessonAssignment::find($id);